In [1]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine
import d6tstack #18.6 출시 pandas 성능향상 패키지

In [8]:
#DB커넥션 열기(기본  + 기능 향상 버전)
#1.postgres
engine = create_engine('postgresql://postgres:postgres@127.0.0.1:5432/postgres')
purl = 'postgresql+psycopg2://postgres:postgres@127.0.0.1:5432/postgres'

#2.mysql
enginemaria = create_engine('mysql+pymysql://root:root@127.0.0.1:3306/webui')
murl = 'mysql+mysqlconnector://kopo:kopo@13.209.112.251:3306/kopo'

#2.mysql
enginemariaSeob = create_engine('mysql+pymysql://root:root@192.168.110.9:3306/wow')
murl = 'mysql+mysqlconnector://kopo:kopo@13.209.112.251:3306/kopo'
enginemariaBk = create_engine('mysql+pymysql://root:root@192.168.110.18:3306/webui',  pool_size=10, max_overflow=20)
engineMariaSl = create_engine('mysql+pymysql://root:root@192.168.110.11:3306/webui')

## postgre

In [26]:
engine

Engine(postgresql://postgres:***@127.0.0.1:5432/postgres)

In [27]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [28]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [29]:
selloutData.columns = ['regionid', 'pg','yearweek','volume']

In [30]:
selloutData.head()

  regionid         pg  yearweek   volume
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [ ]:
resultname = 'pgresult_haeri_190819'  ##표이름에  점(.) 있으면 안된다
resultnamed6stack = 'd6stack_pgresult_haeri_190819'

In [33]:
selloutData.to_sql(resultname, engine, if_exists = 'replace')

In [34]:
d6tstack.utils.pd_to_psql(selloutData, purl, resultnamed6stack, if_exists='replace')

True

In [17]:
readData = pd.read_sql_query("SELECT * FROM pgresult_haeri_190819", engine)

In [21]:
readData.head()

   index regionid         pg  yearweek   volume
0      0      A60   PRODUCT4    201402     71.0
1      1      A60  PRODUCT59    201402  22275.0
2      2      A60  PRODUCT34    201402   4463.0
3      3      A60  PRODUCT47    201402      0.0
4      4      A60  PRODUCT56    201402     23.0

# mariaDB

In [48]:
enginemaria

Engine(mysql+pymysql://root:***@127.0.0.1:3306/webui)

In [49]:
readMariaData = pd.read_sql_query('SELECT * FROM news', enginemaria)

In [50]:
readMariaData.head()

    no      writer title     text
0  136  원그니이아로아러아러   해뤼킴  다 바꿨어용!

In [51]:
readMariaData.columns = ["NO", "WRITER","TITLE","TEXT"]

In [52]:
readMariaData.head()

    NO      WRITER TITLE     TEXT
0  136  원그니이아로아러아러   해뤼킴  다 바꿨어용!

### 형섭이DB에 연결

In [9]:
enginemariaSeob

Engine(mysql+pymysql://root:***@192.168.110.9:3306/wow)

In [13]:
readMariaDataSeob = pd.read_sql_query('SELECT * FROM flight', enginemariaSeob)

In [14]:
readMariaDataSeob.head()

   no flightName aircraftCode departure arrival        departTime       arrivalTime
0   1       A101         A737        서울      파리  2019-05-01 14:00  2019-05-02 14:00
1   4       A102         A787        파리      서울  2019-05-01 14:00  2019-05-01 14:00
2   5       A103         A800        도쿄      서울  2019-05-01 14:00  2019-05-01 14:00
3   6      A104          A855        서울      도쿄  2019-05-01 14:00  2019-05-01 14:00
4   7       A105         A900        서울      세부  2019-05-01 14:00  2019-05-01 14:00

In [41]:
readMariaDataBk = pd.read_sql_query('SELECT * FROM kopo_product_volume', enginemariaBk)

In [44]:
readMariaDataBk.head()

   index REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      0      A01       ST0001    201415  810144
1      1      A01       ST0002    201415  128999
2      2      A01       ST0001    201418  671464
3      3      A01       ST0002    201418  134467
4      4      A01       ST0001    201413  470040

In [16]:
resultSl = pd.read_sql_query('SELECT * FROM kopo_channel_seasonality_new', engineMariaSl)

In [17]:
resultSl.head()

   index REGIONID    PRODUCT  YEARWEEK      QTY
0      0      A60   PRODUCT4    201402     71.0
1      1      A60  PRODUCT59    201402  22275.0
2      2      A60  PRODUCT34    201402   4463.0
3      3      A60  PRODUCT47    201402      0.0
4      4      A60  PRODUCT56    201402     23.0